{
    "skills": [
        "Java",
        "C#",
        "JavaScript",
        "Python",
        "C++",
        "SQL",
        "HTML",
        "CSS",
        "Node.js",
        "React",
        "Angular",
        "Flutter",
        "Dart",
        "Unity"
    ],
    "experiences":[
        {
            "title": "Contract Developer (Capstone Project)",
            "employer": "RBC Royal Bank",
            "employerSite": "https://www.rbcroyalbank.com/personal.html",
            "dates": "September, 2020 - Present",
            "summary": "For my capstone project, myself and three of my colleagues were contracted by RBC to develop a community simulator. We will be using advanced techniques to build models that will predict customer and community characteristics for Canadian communities in a 5-10 year time horizon. We will also be developing a web application to engage with the models spatially and manipulate key parameters to simulate scenarios that may differ from projections.",
            "keyPoints": [
                "Using advanced machine and deep learning tools and libraries such as SciKit, TensorFlow, Pandas, Spark, and Hadoop",
                "Due to signing a non-disclosure agreement with RBC, I will be largely unable to answer questions about the specifics of this project"
            ]
        },
        {
            "title": "Coop Developer",
            "employer": "Indigo Books and Music",
            "employerSite": "https://www.chapters.indigo.ca/en-ca/",
            "dates": "May - August, 2020",
            "summary": "Working alongside an amazing team, I worked on the search and browse experience of Indigo's website. My skills and passion for front-end development grew immensely as I worked on solving challenging problems to help Indigo customers all around the world (including myself).",
            "keyPoints": [
                "Leveraged technologies like ASP.NET and React to update and maintain Indigo.ca",
                "Developed new features including search breadcrumbs to improve the search and browsing experience of Indigo customers",
                "Overhauled customer search and search conversion analytics for a 20% increase in data accuracy"
            ]
        },
        {
            "title": "Software Developer Intern",
            "employer": "BBS Securities Inc.",
            "employerSite": "https://www.bbssecurities.com/",
            "dates": "May - August, 2019",
            "summary": "Returning to BBS Securities for a second internship, I was able to have more responsibilities which resulted in a more rewarding experience for me. I took part in high level meetings and developed bigger and more important projects.",
            "keyPoints": [
                "Generated SQL queries and procedures to automate the process of modifying employee access/permissions",
                "Developed a tool to enable traders to quickly send emails to various groups of clients about new issues and stocks",
                "Worked on developing an automated stock purchasing system which significantly decreased incorrect manual purchases and clients complaints"
            ]
        },
        {
            "title": "Software Developer Intern",
            "employer": "BBS Securities Inc.",
            "employerSite": "https://www.bbssecurities.com/",
            "dates": "May - August, 2018",
            "summary": "Working as a software development intern at BBS Securities, I developed a strong work ethic, while also expanding my teamwork and problem-solving skills. I was also able to learn and work with new technologies like C#, .NET, and SQL.",
            "keyPoints": [
                "Developed an application to receive bank transfer files from BMO and save information to database",
                "Redeveloped C++ legacy code into C# code to help company transition to new technologies"
            ]
        },
        {
            "title": "Founder",
            "employer": "AVA Computer Upgrades",
            "dates": "August 2016 - April 2018",
            "summary": "Launching my first business taught me that success comes to those who are willing to work hard. I turned my passion of building and working on computers into a profitable business and learned a lot in the process.",
            "keyPoints": [
                "Repaired over 50 computer systems over ~2 years of operation",
                "Accumulated over 2000 followers on social media using social media marketing techniques"
            ]
        },
        {
            "title": "Team Member (Front Counter)",
            "employer": "Freshii",
            "employerSite": "https://www.freshii.com/ca/en-ca/home",
            "dates": "October 2015 - July 2016",
            "summary": "This role helped shape me into the person I am today. I learned invaluable skills such as leadership, multi-tasking, humility, and patience as I moved up from the kitchen to the front counter to supervising operations during my shifts.",
            "keyPoints": [
                "Provided friendly and professional customer service",
                "Fully trained 10 new team members in store operations",
                "Supervised operations after demonstrating leadership and a positive attitude"
            ]
        }
    ],
    "projects": [
        {
            "name": "Angular Sound",
            "id": "AngularSound",
            "summary": "A music review site where users can write reviews for songs",
            "description": "A full stack web application made with the Angular framework for the front-end, Node.js for the back-end server, and MongoDB for the database solution. This project is a music review (demo) site in which authenticated users write reviews for songs. Once a user has registered with the site, they are able to write reviews for any song.",
            "github": "https://github.com/aryavatan/Angular-Sound",
            "skills": [
                "Angular",
                "TypeScript",
                "HTML",
                "CSS",
                "JavaScript",
                "Node.js"
            ],
            "secondarySkills" : [
                "MongoDB"
            ],
            "icon":"assets/Projects/AngularSound/2.PNG",
            "pictures": [
                {
                    "caption": "Home Page",
                    "src": "assets/Projects/AngularSound/1.PNG"
                },
                {
                    "caption": "Songs Page",
                    "src": "assets/Projects/AngularSound/2.PNG"
                },
                {
                    "caption": "Song Reviews Page",
                    "src": "assets/Projects/AngularSound/3.PNG"
                },
                {
                    "caption": "Write A Review",
                    "src": "assets/Projects/AngularSound/4.PNG"
                }
            ]
        },
        {
            "name": "OS Chatroom",
            "id": "OSChatroom",
            "summary": "A chatroom web application using client/server architecture",
            "description": "This app was developed as the final project for my Operating Systems course with three other friends. It is a chatroom web application using client/server architecture. Each front-end client enters their display name and can chat with other users in the same \"chatroom\". Clients can also make a private room, the name of the chatroom acts as the password, and chat with their friends. Node.js and Socket.io were used to route the messages between clients and different chatrooms",
            "github": "https://github.com/aryavatan/OS-Chatroom",
            "skills": [
                "JavaScript",
                "HTML",
                "CSS",
                "Node.js"
            ],
            "icon":"assets/Projects/OSChatroom/1.PNG",
            "pictures": [
                {
                    "caption": "Chatroom",
                    "src": "assets/Projects/OSChatroom/1.PNG"
                }
            ]
        },
        {
            "name": "Simple Sketchpad",
            "id": "sketchpad",
            "summary": "A simple sketchpad, similar to microsoft paint",
            "description": "A simple sketchpad, similar to microsoft paint, written in Java using the Java AWT library. In addition to freehand drawing, basic shapes can be drawn as well, such as rectangles, lines, and ellipes. The color of each object can be changed as well, from black, red, green, blue, and yellow. Lastly, there is a save and load feature to allow you to save your sketch and load it later on to keep working on it.",
            "github": "https://github.com/aryavatan/SimpleSketchpad",
            "skills": [
                "Java"
            ],
            "icon":"assets/Projects/Sketchpad/shapes.PNG",
            "pictures": [
                {
                    "caption": "Drawing With Shapes",
                    "src": "assets/Projects/Sketchpad/shapes.PNG"
                },
                {
                    "caption": "Saving Your Drawing",
                    "src": "assets/Projects/Sketchpad/save.PNG"
                },
                {
                    "caption": "Freehand Drawing",
                    "src": "assets/Projects/Sketchpad/freehand.PNG"
                }
            ]
        },
        {
            "name": "aryavatan.ca",
            "id": "aryavatan",
            "summary": "My personal portfolio website, made with Angular",
            "description": "Wanting to increase my understanding of web development and Angular in specific, I created this personal portfolio website for myself. This site serves as a way for me to display my projects and skills in a creative and personal way.",
            "github": "https://github.com/aryavatan/Portfolio",
            "skills": [
                "Angular",
                "HTML",
                "CSS",
                "TypeScript"
            ],
            "secondarySkills" : [
                "Formspree"
            ],
            "icon":"assets/Projects/aryavatan.ca/Home.PNG",
            "pictures": [
                {
                    "caption": "Home Page",
                    "src": "assets/Projects/aryavatan.ca/Home.PNG"
                },
                {
                    "caption": "Work Experience Page",
                    "src": "assets/Projects/aryavatan.ca/WorkExperience.PNG"
                },
                {
                    "caption": "Projects Page",
                    "src": "assets/Projects/aryavatan.ca/Projects.PNG"
                }
            ]
        },
        {
            "name": "Pacman Search",
            "id": "PacmanSearch",
            "summary": "Pacman uses search algorithms to efficiently determine a path to his goal",
            "description": "In this project, the Pacman agent can find paths through his maze world, both to reach a particular location and to collect food efficiently. The Pacman agent uses general search algorithms (informed and uninformed) to efficiently determine a path to his goal. The search algorithms implemented in this project are: depth-first search, breadth-first search, uniform-cost search, and A* search. I found this project on Berkeley University's AI material while working through my own AI course at university.",
            "github": "https://github.com/aryavatan/PacmanSearch",
            "skills": [
                "Python"
            ],
            "icon":"assets/Projects/PacmanSearch/1.PNG",
            "pictures": [
                {
                    "caption": "Uniform-Cost Search (Avoiding Ghosts)",
                    "src": "assets/Projects/PacmanSearch/1.PNG"
                },
                {
                    "caption": "Uniform-Cost Search (Prioritizing Food)",
                    "src": "assets/Projects/PacmanSearch/2.PNG"
                },
                {
                    "caption": "Depth-First Search",
                    "src": "assets/Projects/PacmanSearch/3.PNG"
                },
                {
                    "caption": "Breadth-First Search",
                    "src": "assets/Projects/PacmanSearch/4.PNG"
                }
            ]
        },
        {
            "name": "EnerTrack",
            "id": "EnerTrack",
            "summary": "A carbon tracking application for small businesses",
            "description": "Our inspiration for EnerTrack came from a social issue that our group believed to be incredibly prevalent in today's society - global warming and climate change. We wanted to create a web-app that not only benefits the well-being of our environment through the promotion of low greenhouse gas emissions, but also benefits corporations by reducing their carbon tax rates. We believe that companies are currently facing significant political scrutiny in the face of rising fossil fuel consumption, and as a result, the government is increasing carbon tax rates on their annual metrics in hopes of reducing them. With 2019 being the hottest year in recorded history, we wanted to help alleviate the social tension surrounding this critical issue. After exploring the scientific, political and social implications of this topic, and researching the market, we created EnerTrack. EnerTrack is a web-app designed to simplify, track and project the carbon consumption of corporations with large carbon footprints. In 4 simple steps, our web-app will analyze your company’s objectives, track your consumption and footprint, calculate your estimated carbon tax and social costs, and match you with more eco-friendly and cost-effective alternatives using our database. Our stack for this project comprised of ReactJS, ExpressJS and MongoDB. We built the front-end with React, utilizing multiple libraries like Bootstrap. React sent requests to our back-end, which was created with ExpressJS. Express handled all our requests to and from our front-end and also communicating with our database. Our database was created with MongoDB. MongoDb provided a simple way to install and implement a database.",
            "github": "https://github.com/ssarin1999/EnactusHacks2020",
            "devpost": "https://devpost.com/software/enactus",
            "skills": [
                "React",
                "HTML",
                "CSS",
                "JavaScript"
            ],
            "secondarySkills" : [
                "Node.js",
                "MongoDB"
            ],
            "icon":"assets/Projects/EnerTrack/Landing Page.PNG",
            "pictures": [
                {
                    "caption": "Landing Page",
                    "src": "assets/Projects/EnerTrack/Landing Page.PNG"
                },
                {
                    "caption": "Entering your monthly carbon usage",
                    "src": "assets/Projects/EnerTrack/Entering Monthly Usage.PNG"
                },
                {
                    "caption": "Recommendations given based on your information",
                    "src": "assets/Projects/EnerTrack/Recommendations Based on Preferences.PNG"
                },
                {
                    "caption": "Your Usage Dashboard",
                    "src": "assets/Projects/EnerTrack/Your Usage Dashboard.PNG"
                }
            ]
        }
    ]
}